package TasksFromIgor.Lesson1;

public class New {

    // Принимет два чесла типа Int Возвращает их сумму
 public static int sumTwoNumbers(int a, int b){

     return a+b;

 }

    public static void main(String[] args) {

        FealdDefine fealdDefine1= new FealdDefine(12,"Java12");
        //fealdDefine1.setA(25);
       //fealdDefine1.setB("Java");

        System.out.println(fealdDefine1.getA());
        System.out.println(fealdDefine1.getB());

    }
// Создать класс в нём два поля Int и String. Создать объект этого класса в котором значение переменной Int =25 Strintg= "JAVA"


  class FaldDefine {


// Создать два класса в первом классе объявить 3 поля во вором объявить 2 поля. В Main создать 2 объекта первого класса два объекта второго класса с одинаковыми полями.
// Сравнить объекты первого и второго класса между собой.
}


}
